In [175]:
import numpy as np

In [176]:
import pandas as pd

In [177]:
data = pd.read_excel('Online Retail.xlsx')

In [178]:
len(data)

541909

In [179]:
data.dropna(inplace=True)

In [180]:
data.drop(data[data['UnitPrice']<=0].index,inplace=True)

In [181]:
data.drop(data[data['Quantity']<=0].index,inplace=True)

In [182]:
len(data)

397884

In [183]:
data['InvoiceNo'].str.startswith('c',na=False)

0         False
1         False
2         False
3         False
4         False
5         False
6         False
7         False
8         False
9         False
10        False
11        False
12        False
13        False
14        False
15        False
16        False
17        False
18        False
19        False
20        False
21        False
22        False
23        False
24        False
25        False
26        False
27        False
28        False
29        False
          ...
541879    False
541880    False
541881    False
541882    False
541883    False
541884    False
541885    False
541886    False
541887    False
541888    False
541889    False
541890    False
541891    False
541892    False
541893    False
541894    False
541895    False
541896    False
541897    False
541898    False
541899    False
541900    False
541901    False
541902    False
541903    False
541904    False
541905    False
541906    False
541907    False
541908    False
Name: InvoiceNo, Length: 397884, dtype: bool

In [184]:
data.drop(data[data['InvoiceNo'].str.startswith('C',na=False)==True].index,inplace=True)

In [185]:
#data['CustomerID'].sort_values(ascending=True)

In [186]:
def time(x):
    y=pd.Timestamp(x).to_pydatetime().year
    if(y==2010):
        y=0
    if(y==2011):
        y=1
    return y
data['year']=data['InvoiceDate'].apply(time)

In [187]:
def tt(x):
    y=pd.Timestamp(x).to_pydatetime().month
    return y
def ttt(x):
    y=pd.Timestamp(x).to_pydatetime().day
    return y
data['month']=data['InvoiceDate'].apply(tt)
data['day']=data['InvoiceDate'].apply(ttt)

In [188]:
data.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,year,month,day
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,0,12,1
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,0,12,1
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,0,12,1
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,0,12,1
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,0,12,1

In [189]:
data['recency']=(data['year'])*365+(data['month']-1)*31+data['day']

In [190]:
data.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,year,month,day,recency
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,0,12,1,342
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,0,12,1,342
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,0,12,1,342
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,0,12,1,342
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,0,12,1,342

In [191]:
finaldf=pd.DataFrame

In [192]:
df = pd.DataFrame(data.groupby('CustomerID')['recency'].max())

In [207]:
df.head()

            recency
CustomerID
12346.0         383
12347.0         713
12348.0         638
12349.0         696
12350.0         398

In [208]:
df['recency']=1/(730-df['recency']) ##subtracted from jan 2012 and weight give to recency score is 50

In [209]:
df['recency']=df['recency']/df['recency'].max()

In [210]:
df['recency']*=50

In [211]:
df.head()

              recency
CustomerID
12346.0      2.161383
12347.0     44.117647
12348.0      8.152174
12349.0     22.058824
12350.0      2.259036

In [212]:
data['Dates']=data['InvoiceDate'].apply(lambda x:str(x).split(" ")[0])
data.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,year,month,day,recency,Dates
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,0,12,1,342,2010-12-01
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,0,12,1,342,2010-12-01
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,0,12,1,342,2010-12-01
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,0,12,1,342,2010-12-01
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,0,12,1,342,2010-12-01

In [213]:
#data.groupby('CustomerID')['Dates'].nunique()

In [214]:
df['frequency']=pd.DataFrame(data.groupby('CustomerID')['Dates'].nunique())

In [215]:
#df.head()

In [217]:
df['minimum'] = pd.DataFrame(data.groupby('CustomerID')['recency'].min())

In [218]:
df['minimum']=730-df['minimum']

In [219]:
df.head()

              recency  frequency  minimum
CustomerID
12346.0      2.161383          1      347
12347.0     44.117647          7      382
12348.0      8.152174          4      373
12349.0     22.058824          1       34
12350.0      2.259036          1      332

In [220]:
df['frequency']/=df['minimum']

In [221]:
df['frequency']=df['frequency']/df['frequency'].max()

In [222]:
df['frequency']*=40

In [223]:
df.head()

              recency  frequency  minimum
CustomerID
12346.0      2.161383   0.338835      347
12347.0     44.117647   2.154530      382
12348.0      8.152174   1.260866      373
12349.0     22.058824   3.458111       34
12350.0      2.259036   0.354144      332

In [224]:
data['netPrice']=data['UnitPrice']*data['Quantity']

In [225]:
# data.head()

In [226]:
df['monetary']=pd.DataFrame(data.groupby('CustomerID')['netPrice'].sum())

In [227]:
df.head()

              recency  frequency  minimum  monetary
CustomerID
12346.0      2.161383   0.338835      347  77183.60
12347.0     44.117647   2.154530      382   4310.00
12348.0      8.152174   1.260866      373   1797.24
12349.0     22.058824   3.458111       34   1757.55
12350.0      2.259036   0.354144      332    334.40

In [228]:
df['monetary']=df['monetary']/df['monetary'].max()

In [229]:
df.head()

              recency  frequency  minimum  monetary
CustomerID
12346.0      2.161383   0.338835      347  0.275453
12347.0     44.117647   2.154530      382  0.015382
12348.0      8.152174   1.260866      373  0.006414
12349.0     22.058824   3.458111       34  0.006272
12350.0      2.259036   0.354144      332  0.001193

In [230]:
df['monetary']*=20
df.head()

              recency  frequency  minimum  monetary
CustomerID
12346.0      2.161383   0.338835      347  5.509061
12347.0     44.117647   2.154530      382  0.307631
12348.0      8.152174   1.260866      373  0.128280
12349.0     22.058824   3.458111       34  0.125447
12350.0      2.259036   0.354144      332  0.023868

In [231]:
df.drop(['minimum'],axis=1,inplace=True)

In [232]:
df.head()

              recency  frequency  monetary
CustomerID
12346.0      2.161383   0.338835  5.509061
12347.0     44.117647   2.154530  0.307631
12348.0      8.152174   1.260866  0.128280
12349.0     22.058824   3.458111  0.125447
12350.0      2.259036   0.354144  0.023868

In [234]:
df['sum']=df['recency']+df['frequency']+df['monetary']

In [235]:
df.head()

              recency  frequency  monetary        sum
CustomerID
12346.0      2.161383   0.338835  5.509061   8.009279
12347.0     44.117647   2.154530  0.307631  46.579807
12348.0      8.152174   1.260866  0.128280   9.541320
12349.0     22.058824   3.458111  0.125447  25.642381
12350.0      2.259036   0.354144  0.023868   2.637048

In [236]:
df1=df

In [237]:
df1 = df.sort_values('sum',ascending=False)

In [238]:
df1.head()

            recency  frequency   monetary        sum
CustomerID
14911.0      46.875  40.000000  10.265665  97.140665
12748.0      50.000  34.242424   2.406781  86.649206
17841.0      46.875  33.939394   2.925817  83.740210
15311.0      50.000  27.272727   4.337373  81.610100
14646.0      46.875  14.338507  20.000000  81.213507

In [239]:
df1.to_csv('rfm_model.csv')